Revit 2027 API
ElementCategoryFilter(BuiltInCategory) Constructor
 Constructs a new instance of a filter to match elements by category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementCategoryFilter(
	BuiltInCategory category
)
Public Sub New (
	category As BuiltInCategory
)
public:
ElementCategoryFilter(
	BuiltInCategory category
)
new :
        category : BuiltInCategory -> ElementCategoryFilter
Parameters
category BuiltInCategory
 The category to match.
See Also
Reference
ElementCategoryFilter Class
ElementCategoryFilter Overload
Autodesk.Revit.DB Namespace